app/views/comments/index.html.erb

    <p class="h6"><%= comment.content %></p>
    <p><i>by <%= User.find(comment.user_id).username %></i></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]