app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "C nul"], ["user_id", 1], ["post_id", 2], ["created_at", "2018-02-18 19:03:22.919608"], ["updated_at", "2018-02-18 19:03:22.919608"]]
---
    def create
        @post = Post.find(params[:post_id])
        @comment = @post.comments.create(params[:comment].permit!)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT ?  [["post_id", 2], ["id", 5], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 5]]
---
    def destroy
        @post = Post.find params[:post_id]
        @comment = @post.comments.find params[:id]
        @comment.destroy