app/controllers/posts_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @comment = Comment.new
        @user = User.find(@post.user_id)

INSERT INTO "posts" ("title", "subtitle", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "booba"], ["subtitle", "a"], ["content", "a"], ["user_id", 1], ["created_at", "2018-02-18 16:33:14.190573"], ["updated_at", "2018-02-18 16:33:14.190573"]]
---
    def create
        post = Post.create(params[:post].permit!)